ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR128DA32def.inc
; PORTMUX_ACROUTEA masks
.equ PORTMUX_AC0_bm = 0x01               ; Analog Comparator 0 Output bit mask
.equ PORTMUX_AC0_bp = 0                  ; Analog Comparator 0 Output bit position
.equ PORTMUX_AC1_bm = 0x02               ; Analog Comparator 1 Output bit mask
.equ PORTMUX_AC1_bp = 1                  ; Analog Comparator 1 Output bit position
.equ PORTMUX_AC2_bm = 0x04               ; Analog Comparator 2 Output bit mask
.equ PORTMUX_AC2_bp = 2                  ; Analog Comparator 2 Output bit position

; PORTMUX_ZCDROUTEA masks
.equ PORTMUX_ZCD0_bm = 0x01              ; Zero Cross Detector 0 Output bit mask
.equ PORTMUX_ZCD0_bp = 0                 ; Zero Cross Detector 0 Output bit position

; Analog Comparator 0 Output select
.equ PORTMUX_AC0_DEFAULT_gc = (0x00<<0)  ; OUT on PA7

; Analog Comparator 1 Output select
.equ PORTMUX_AC1_DEFAULT_gc = (0x00<<1)  ; OUT on PA7

; Analog Comparator 2 Output select
.equ PORTMUX_AC2_DEFAULT_gc = (0x00<<2)  ; OUT on PA7

; CCL Look-Up Table 0 Signals select
.equ PORTMUX_LUT0_DEFAULT_gc = (0x00<<0) ; Out: PA3 In: PA0, PA1, PA2
.equ PORTMUX_LUT0_ALT1_gc = (0x01<<0)    ; Out: PA6 In: PA0, PA1, PA2

; CCL Look-Up Table 1 Signals select
.equ PORTMUX_LUT1_DEFAULT_gc = (0x00<<1) ; Out: PC3 In: PC0, PC1, PC2

; CCL Look-Up Table 2 Signals select
.equ PORTMUX_LUT2_DEFAULT_gc = (0x00<<2) ; Out: PD3 In: PD0, PD1, PD2
.equ PORTMUX_LUT2_ALT1_gc = (0x01<<2)    ; Out: PD6 In: PD0, PD1, PD2

; CCL Look-Up Table 3 Signals select
.equ PORTMUX_LUT3_DEFAULT_gc = (0x00<<3) ; Out: PF3 In: PF0, PF1, PF2

; Event Output A select
.equ PORTMUX_EVOUTA_DEFAULT_gc = (0x00<<0) ; EVOUT on PA2
.equ PORTMUX_EVOUTA_ALT1_gc = (0x01<<0)  ; EVOUT on PA7

; Event Output C select
.equ PORTMUX_EVOUTC_DEFAULT_gc = (0x00<<2) ; EVOUT on PC2

; Event Output D select
.equ PORTMUX_EVOUTD_DEFAULT_gc = (0x00<<3) ; EVOUT on PD2
.equ PORTMUX_EVOUTD_ALT1_gc = (0x01<<3)  ; EVOUT on PD7

; Event Output F select
.equ PORTMUX_EVOUTF_DEFAULT_gc = (0x00<<5) ; EVOUT on PF2

; SPI0 Signals select
.equ PORTMUX_SPI0_DEFAULT_gc = (0x00<<0) ; PA4, PA5, PA6, PA7
.equ PORTMUX_SPI0_NONE_gc = (0x03<<0)    ; Not connected to any pins

; SPI1 Signals select
.equ PORTMUX_SPI1_DEFAULT_gc = (0x00<<2) ; PC0, PC1, PC2, PC3
.equ PORTMUX_SPI1_NONE_gc = (0x03<<2)    ; Not connected to any pins

; TCA0 Signals select
.equ PORTMUX_TCA0_PORTA_gc = (0x00<<0)   ; PA0, PA1, PA2, PA3, PA4, PA5
.equ PORTMUX_TCA0_PORTC_gc = (0x02<<0)   ; PC0, PC1, PC2, PC3, PC4, PC5
.equ PORTMUX_TCA0_PORTD_gc = (0x03<<0)   ; PD0, PD1, PD2, PD3, PD4, PD5
.equ PORTMUX_TCA0_PORTF_gc = (0x05<<0)   ; PF0, PF1, PF2, PF3, PF4, PF5

; TCB0 Output select
.equ PORTMUX_TCB0_DEFAULT_gc = (0x00<<0) ; WO on PA2
.equ PORTMUX_TCB0_ALT1_gc = (0x01<<0)    ; WO on PF4

; TCB1 Output select
.equ PORTMUX_TCB1_DEFAULT_gc = (0x00<<1) ; WO on PA3
.equ PORTMUX_TCB1_ALT1_gc = (0x01<<1)    ; WO on PF5

; TCB2 Output select
.equ PORTMUX_TCB2_DEFAULT_gc = (0x00<<2) ; WO on PC0

; TCD0 Signals select
.equ PORTMUX_TCD0_DEFAULT_gc = (0x00<<0) ; PA4, PA5, PA6, PA7
.equ PORTMUX_TCD0_ALT2_gc = (0x02<<0)    ; PF0, PF1, PF2, PF3

; TWI0 Signals select
.equ PORTMUX_TWI0_DEFAULT_gc = (0x00<<0) ; PA2, PA3, PC2, PC3
.equ PORTMUX_TWI0_ALT2_gc = (0x02<<0)    ; PC2, PC3, PC6, PC7

; TWI1 Signals select
.equ PORTMUX_TWI1_DEFAULT_gc = (0x00<<2) ; PF2, PF3, PB2, PB3

; USART0 Signals select
.equ PORTMUX_USART0_DEFAULT_gc = (0x00<<0) ; PA0, PA1, PA2, PA3
.equ PORTMUX_USART0_ALT1_gc = (0x01<<0)  ; PA4, PA5, PA6, PA7
.equ PORTMUX_USART0_NONE_gc = (0x03<<0)  ; Not connected to any pins

; USART1 Signals select
.equ PORTMUX_USART1_DEFAULT_gc = (0x00<<2) ; PC0, PC1, PC2, PC3
.equ PORTMUX_USART1_NONE_gc = (0x03<<2)  ; Not connected to any pins

; USART2 Signals select
.equ PORTMUX_USART2_DEFAULT_gc = (0x00<<4) ; PF0, PF1, PF2, PF3
.equ PORTMUX_USART2_ALT1_gc = (0x01<<4)  ; PF4, PF5
.equ PORTMUX_USART2_NONE_gc = (0x03<<4)  ; Not connected to any pins

; Zero Cross Detector 0 Output select
.equ PORTMUX_ZCD0_DEFAULT_gc = (0x00<<0) ; OUT on PA7


;*************************************************************************
;** PTC - Peripherial Touch Controller
;*************************************************************************


;*************************************************************************
;** RSTCTRL - Reset controller
;*************************************************************************

; RSTCTRL_RSTFR masks
.equ RSTCTRL_PORF_bm = 0x01              ; Power on Reset flag bit mask
.equ RSTCTRL_PORF_bp = 0                 ; Power on Reset flag bit position
.equ RSTCTRL_BORF_bm = 0x02              ; Brown out detector Reset flag bit mask
.equ RSTCTRL_BORF_bp = 1                 ; Brown out detector Reset flag bit position
.equ RSTCTRL_EXTRF_bm = 0x04             ; External Reset flag bit mask
.equ RSTCTRL_EXTRF_bp = 2                ; External Reset flag bit position
.equ RSTCTRL_WDRF_bm = 0x08              ; Watch dog Reset flag bit mask
.equ RSTCTRL_WDRF_bp = 3                 ; Watch dog Reset flag bit position
.equ RSTCTRL_SWRF_bm = 0x10              ; Software Reset flag bit mask
.equ RSTCTRL_SWRF_bp = 4                 ; Software Reset flag bit position
.equ RSTCTRL_UPDIRF_bm = 0x20            ; UPDI Reset flag bit mask
.equ RSTCTRL_UPDIRF_bp = 5               ; UPDI Reset flag bit position

; RSTCTRL_SWRR masks
.equ RSTCTRL_SWRST_bm = 0x01             ; Software reset enable bit mask
.equ RSTCTRL_SWRST_bp = 0                ; Software reset enable bit position


;*************************************************************************
;** RTC - Real-Time Counter
;*************************************************************************

; RTC_CTRLA masks
.equ RTC_RTCEN_bm = 0x01                 ; Enable bit mask
.equ RTC_RTCEN_bp = 0                    ; Enable bit position
.equ RTC_CORREN_bm = 0x04                ; Correction enable bit mask
.equ RTC_CORREN_bp = 2                   ; Correction enable bit position
.equ RTC_PRESCALER_gm = 0x78             ; Prescaling Factor group mask
.equ RTC_PRESCALER_gp = 3                ; Prescaling Factor group position
.equ RTC_PRESCALER_0_bm = (1<<3)         ; Prescaling Factor bit 0 mask
.equ RTC_PRESCALER_0_bp = 3              ; Prescaling Factor bit 0 position
.equ RTC_PRESCALER_1_bm = (1<<4)         ; Prescaling Factor bit 1 mask
.equ RTC_PRESCALER_1_bp = 4              ; Prescaling Factor bit 1 position
.equ RTC_PRESCALER_2_bm = (1<<5)         ; Prescaling Factor bit 2 mask
.equ RTC_PRESCALER_2_bp = 5              ; Prescaling Factor bit 2 position
.equ RTC_PRESCALER_3_bm = (1<<6)         ; Prescaling Factor bit 3 mask
.equ RTC_PRESCALER_3_bp = 6              ; Prescaling Factor bit 3 position
.equ RTC_RUNSTDBY_bm = 0x80              ; Run In Standby bit mask
.equ RTC_RUNSTDBY_bp = 7                 ; Run In Standby bit position

